/********************************************************************************
* @File name: RTOS_sem.h
* @Author: zspace
* @Version: 1.0
* @Date: 2020-4-10
* @Description: RTOS 信号量模块
********************************************************************************/
#ifndef _RTOS_SEM_H__
#define _RTOS_SEM_H__
#ifdef __cplusplus
 extern "C" {
#endif 
/*********************************头文件包含************************************/
#include "RTOS_type.h"
/*********************************结束******************************************/

/*********************************宏定义************************************/
#define SEM_WAIT_ENDLESS 0xFFFFFFFF		/*一直等待*/
/*********************************结束******************************************/

/*********************************自定义类型************************************/
/*信号量的控制块*/
typedef struct {
	uint32 	semVal;
	uint32 	semMaxVal;
	uint8		semVaild;
}*PSEM_CB,SEM_CB;
/*********************************结束******************************************/

/*********************************函数申明************************************/
PSEM_CB SemCreate(uint32 initVal,uint32 maxVal);
void 		SemFree(PSEM_CB pSEM);
uint32 	SemPost(PSEM_CB pSEM);
uint32 	SemPend(PSEM_CB pSEM,uint32 semWaitDelay);
/*********************************结束******************************************/

#ifdef __cplusplus
}
#endif
#endif
