/********************************************************************************
* @File name: RTOS_mutex.c
* @Author: zspace
* @Version: 1.0
* @Date: 2020-4-10
* @Description: RTOS 互斥锁模块
********************************************************************************/
#ifndef _RTOS_MUTEX_H__
#define _RTOS_MUTEX_H__
#ifdef __cplusplus
 extern "C" {
#endif 
/*********************************头文件包含************************************/
#include "RTOS_type.h"
/*********************************结束******************************************/

/*********************************宏定义************************************/
#define MUTEX_WAIT_ENDLESS 0xFFFFFFFF		/*一直等待*/
/*********************************结束******************************************/

/*********************************自定义类型************************************/
typedef struct _MUTEX{
	/*互斥量锁标志*/
	uint8 mutexFlag;
}*PMUTEX_CB,MUTEX_CB;
/*********************************结束******************************************/

/*********************************头文件包含************************************/

PMUTEX_CB MutexCreate(void);
void 			MutexFree(PMUTEX_CB mMUTEX);

uint32 		MutexUnlock(PMUTEX_CB mMUTEX);
uint32 		MutexLock(PMUTEX_CB mMUTEX,uint32 mutexWaitDelay);
/*********************************结束******************************************/

#ifdef __cplusplus
}
#endif
#endif
