/********************************************************************************
* @File name: RTOS_mem.c
* @Author: zspace
* @Version: 1.0
* @Date: 2020-4-10
* @Description: RTOS 内存管理
********************************************************************************/
#ifndef _RTOS_MALLOC_H__
#define _RTOS_MALLOC_H__
#ifdef __cplusplus
 extern "C" {
#endif 
/*********************************头文件包含************************************/
#include "RTOS_type.h"
/*********************************结束******************************************/

/*********************************宏定义************************************/
#define MALLOC_MEM_SIZE (8*1024)
#define MALLOC_BLOCK_SIZE (8)
#define MALLOC_MANAGER_TABLE (MALLOC_MEM_SIZE/MALLOC_BLOCK_SIZE)
/*********************************结束******************************************/

/*********************************函数申明************************************/
void 	InitMem(void);
void *OSMalloc(uint32 size);
void 	OSFree(void* mem);
/*********************************结束******************************************/
#ifdef __cplusplus
}
#endif
#endif

